app/controllers/project/projects_controller.rb

  def index
    @coding_projects = Project.where(category: "coding")
---
SELECT "projects".* FROM "projects" WHERE "projects"."category" = ?  [["category", "coding"]]

  def show
    @related = Project.categorized_by(@project.category).where.not(id: @project.id)
    @comment = Comment.new
    @commentable = Commentable.find_by(
            object_id: @project.id,
            object_type: Comment.get_model(request.env["REQUEST_PATH"])
            )
---
SELECT  "commentables".* FROM "commentables" WHERE "commentables"."object_id" = ? AND "commentables"."object_type" = ? LIMIT ?  [["object_id", 1], ["object_type", "Project"], ["LIMIT", 1]]

  def show_tag
    @projects = Project.where("tags LIKE '%#{params[:tag]}%'")
---
SELECT "projects".* FROM "projects" WHERE (tags LIKE '%social-media%')

  def create
    @project = Project.new(project_params)
    @project.admin = current_admin
    @project.save!
---
INSERT INTO "projects" ("name", "tags", "category", "created_at", "updated_at", "github", "website", "admin_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @project.update(project_params)
---
UPDATE "projects" SET "summary" = ?, "updated_at" = ? WHERE "projects"."id" = ?

  def set_project
    @project = Project.find_by(id: params[:id]) || Project.find_by_slug(params[:slug])
---
SELECT "projects".* FROM "projects" WHERE (category LIKE '%coding%') AND ("projects"."id" != ?)  [["id", 1]]