app/controllers/blog/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."category_name" = ?  [["category_name", "economics"]]
---
    def show_category
        @articles = Article.where(category_name: params[:category])