app/controllers/blog/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."published" = ? AND "articles"."project_id" IS NULL ORDER BY created_at DESC  [["published", "t"]]
---
    def index
        @articles = Article.published.not_associated_with_project
                            .order("created_at DESC")

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def article_redirect_from_short_url
        @article = Article.find_by(id: params[:id])

SELECT "articles".* FROM "articles" WHERE (category_name LIKE '%economics%') AND ("articles"."id" != ?)  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
SELECT COUNT(*) FROM "articles" WHERE (category_name LIKE '%economics%') AND ("articles"."id" != ?)  [["id", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? ORDER BY "admins"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."published" = ? AND "articles"."project_id" IS NULL AND (category_name LIKE '%%') AND ("articles"."id" != ?)  [["published", "t"], ["id", 11]]
SELECT  "commentables".* FROM "commentables" WHERE "commentables"."object_id" = ? AND "commentables"."object_type" = ? LIMIT ?  [["object_id", 1], ["object_type", "Article"], ["LIMIT", 1]]
---
    def show
        @article = Article.find_by(id: params[:id])
        if !@article.published
            if !current_admin || (current_admin != @article.admin)
                redirect_to "/blog", notice: "this article was not found"
                return
            end
        end

        @comments = @article.comments.paginate(page: params[:page], per_page: 30)
        @related = Article.published.not_associated_with_project
                            .categorized_by(@article.category_name)
                            .where.not(id: @article.id)


        @commentable = Commentable.find_by(
            object_id: params[:id],
            object_type: Comment.get_model(request.env["REQUEST_PATH"])
            )

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @article = Article.find_by(id: params[:id])

UPDATE "articles" SET "tags" = ?, "category_name" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["tags", "ruby,rails,other,stuff,here"], ["category_name", "technology"], ["updated_at", "2019-09-15 02:11:43.514141"], ["id", 1]]
---
    def update
        @article.project_id = params[:article][:project_id]
        @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 10]]
---
    def destroy
        @article.delete

INSERT INTO "articles" ("content", "title", "created_at", "updated_at", "tags", "admin_id", "category_name", "published", "image_link", "series_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @article = Article.new(article_params)
        @article.admin = current_admin
        @article.project_id = params[:project_id] if params[:project_id]
        @article.save!

SELECT "articles".* FROM "articles" WHERE "articles"."published" = ? AND "articles"."project_id" IS NULL ORDER BY created_at DESC  [["published", "t"]]
SELECT "articles".* FROM "articles" WHERE "articles"."published" = ? AND "articles"."project_id" IS NULL AND "articles"."category_name" = ? ORDER BY created_at DESC  [["published", "t"], ["category_name", "politics"]]
---
    def filter_by_category
        if params[:category] == 'all'
            @articles = Article.published.not_associated_with_project
                                .all.order("created_at DESC")
        else
            @articles = Article.published.not_associated_with_project
                                .where(category_name: params[:category])
                                .order("created_at DESC")