app/controllers/blog/comments_controller.rb

INSERT INTO "comments" ("content", "commenter_name", "commenter_email", "created_at", "updated_at", "commentable_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @comment = Comment.new(comment_params)
    @comment.article = Article.find(params[:comment][:article_id])

    respond_to do |format|
      if @comment.save