app/views/project/projects/_projects.html.erb

    <p style="margin-bottom: 0; color: green;">
        <%= pluralize(projects.count, "project") %>
---
SELECT "projects".* FROM "projects" WHERE (tags LIKE '%social-media%')
SELECT COUNT(*) FROM "projects" WHERE (tags LIKE '%social-media%')