app/views/project/projects/show.html.erb

                <div>
                    <% if @project.featured_article.present? %>
---
SELECT  "articles".* FROM "articles" WHERE "articles"."project_id" = ? ORDER BY "articles"."id" ASC LIMIT ?  [["project_id", 1], ["LIMIT", 1]]