app/controllers/admins_controller.rb

UPDATE "admins" SET "website" = ?, "twitter" = ?, "linkedin" = ?, "instagram" = ?, "github" = ?, "bio" = ?, "facebook" = ?, "updated_at" = ? WHERE "admins"."id" = ?
---
  def update
    @admin.update(admin_params)