app/controllers/articles_controller.rb

    def show
        @article = Article.find_by(slug: params[:slug], id: params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."slug" = ? AND "articles"."id" IS NULL LIMIT ?  [["slug", "create"], ["LIMIT", 1]]