app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @article = Article.find_by(id: params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "religion"], ["LIMIT", 1]]
INSERT INTO "articles" ("content", "title", "created_at", "updated_at", "category_id", "tags") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @article = Article.new(article_params)
        @category = Category.find_by(name: params[:article][:category])
        @article.category = @category
        @article.save!