app/controllers/comments_controller.rb

SELECT  "commentables".* FROM "commentables" WHERE "commentables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "commenter_name", "commenter_email", "created_at", "updated_at", "commentable_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @comment = Comment.new(comment_params)
    @comment.commentable = Commentable.find(params[:comment][:commentable_id])
    @comment.save!