app/controllers/fitness_controller.rb

    def index
        @article = Article.all.find do |a|
---
SELECT  "articles".* FROM "articles" WHERE (tags LIKE 'fitness') ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 1]]