app/controllers/pages_controller.rb

    def home
        @latest_posts = Article.published.where(project_id: nil).order("created_at DESC").limit(10)
        @latest_series = Series.live.limit(5)
        @latest_projects = Project.all.order("created_at DESC").last(5)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."published" = ? AND "articles"."project_id" IS NULL ORDER BY created_at DESC LIMIT ?  [["published", "t"], ["LIMIT", 10]]
SELECT  "series".* FROM "series" WHERE "series"."live" = ? LIMIT ?  [["live", "t"], ["LIMIT", 5]]
SELECT  "projects".* FROM "projects" ORDER BY created_at ASC LIMIT ?  [["LIMIT", 5]]

    def latest
        @article = Article.last
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 1]]