app/controllers/pages_controller.rb

SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" DESC LIMIT ?  [["LIMIT", 5]]
---
    def home
        @featured_post = Article.last # for now, will replace later with piece of code
        @latest_posts = Article.last(4) # for now, will replace with arbitrary number
        @latest_projects = Project.last(5)