app/controllers/pages_controller.rb

SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "articles".* FROM "articles"
---
    def home
        @featured_post = Article.last # for now, will replace later with piece of code
        @latest_posts = Article.all # for now, will replace with arbitrary number