app/controllers/series_controller.rb

INSERT INTO "series" ("name", "description", "slug", "created_at", "updated_at", "admin_id", "live") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @series = Series.new(series_params)
    @series.admin = current_admin

    if @series.save

SELECT  "series".* FROM "series" WHERE "series"."slug" = ? LIMIT ?  [["slug", "sjih"], ["LIMIT", 1]]
---
  def set_series
    @series = Series.find_by(id: params[:id]) || Series.find_by(slug: params[:slug].upcase)