app/controllers/freelance/freelance_controller.rb

    def show
        @project_article = Article.find_by(title: params[:name])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."title" = ? LIMIT ?  [["title", "Senzzu"], ["LIMIT", 1]]